---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomName
source: html/e49319ae-779b-d9f3-e2d1-4846ca104e39.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomName Property

"Room Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceAssocRoomName { get; }
```